Show / Hide Table of Contents
Class ResultOnSection
Result of section on the member
Inheritance
System.Object
ResultBase
ResultOnSection
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Result
Assembly: IdeaRS.OpenModel.dll
Syntax
[Obfuscation(Feature = "renaming")]
public class ResultOnSection : ResultBase
Constructors
Improve this Doc   View Source
ResultOnSection()
Constructor
Declaration
public ResultOnSection()
Properties
Improve this Doc   View Source
AbsoluteRelative
Absolute of relative value of position is used
Declaration
public AbsoluteRelative AbsoluteRelative { get; set; }
Property Value
 Type |  Description
 AbsoluteRelative
Improve this Doc   View Source
Position
Position of section
Declaration
public double Position { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Results
List of result of members
Declaration
public List<SectionResultBase> Results { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<SectionResultBase>
 Improve this Doc
 View Source